package Pr_1_1_XML.SAXParserForStudents;

/**
 * Created by Oleksandr Dudkin on 22.02.2016.
 *
 * БД на сервере, клиент тонкий, идет обмен сообщениями между клиентами и серверами.
 * Команды от клиента и изменения должны передаваться в виде строки, которая представляет собой хмл-элементы.
 *
 * Я хочу попробовать передать xml между клиентом и сервером.
 * То есть, надо преобразовать xml в строку. Я потом обратно сделать из строки xml.
 *
 * Смотрел про передачу xml, но там посто их файла считывается построчно и слепляется в стрингбилдер.
 * А эта строка в потоке передаётся. Нужно сделать из данных строку?
 */
public class Transmission {

}
